In [1]:
import pandas as pd

#### Series
    -> initialization, print, index, values, type, datatype
    -> series can be collection of multiple data types and index of any type

In [ ]:
s1 = pd.Series([1,2,3,4,5])
print(s1)

s2 = pd.Series([10,20,30], dtype = float, index=(['a','b','c']))
print("\n")
print(type(s2))
print(s2.index)
print(s2.values) #values bcz contains more then one 
print(s2.dtype)

0    1
1    2
2    3
3    4
4    5
dtype: int64


<class 'pandas.core.series.Series'>
Index(['a', 'b', 'c'], dtype='object')
[10. 20. 30.]
float64

#### DataFrame
    -> sb cheze frame like me store hai 

    # Dictionary contain column of any ( series,list,tuple,1D array) type
     -> but sb cheze horizontally hai

    # Declaring the DataFrame direclty
     ->pd.DataFrame(dictionary material)

In [ ]:
dict = {
    'col1' : [1,2,3,4,5],
    'col2' : pd.Series([10,20,30,40,50])
}

print(dict)

# changing dictionary to data frame

df = pd.DataFrame(dict)
print(df)
print(df.dtypes)
print(df.index)
print(df.values)

#declaring the DataFrame direclty
# df1 = pd.DataFrame({dictionary material}) or pd.DataFrame(dictionary)

df1 = pd.DataFrame({ 'id':[10,20,30,40,50], 'Physics' : [87,85,94,58,76] })
print(df1)
 #here storing data frame

{'col1': [1, 2, 3, 4, 5], 'col2': 0    10
1    20
2    30
3    40
4    50
dtype: int64}
   col1  col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50
col1    int64
col2    int64
dtype: object
RangeIndex(start=0, stop=5, step=1)
[[ 1 10]
 [ 2 20]
 [ 3 30]
 [ 4 40]
 [ 5 50]]
   id  Physics
0  10       87
1  20       85
2  30       94
3  40       58
4  50       76

#### Merge in Pandas
    -> jaise sql me tables ko join krte the same
    -> bas yha hme direct excel/csv file available h
    -> inner, left, right, outer merge
    -> NaN is null
    -> df1 --> left table, df2--> right table

    #Concat(for union 2 tables)
     ->stack/ join/ append one data frame on another
     ->to execute concat ensure column name should be common (both table me same column exit must)
     ->if objective is to combnine monthly data to master table data

In [49]:
df1 = pd.DataFrame({'id':[1,2,3,4,5], 'Maths':[87,98,45,67,59] })
df2 = pd.DataFrame({'id':[3,4,5,6,7], 'Physics':[89,85,86,45,90]})

print(df1.merge(df2, on ='id', how ='inner'))#common in both
print(df1.merge(df2, on = 'id', how = 'left'))#left common data
print(df1.merge(df2, on = 'id', how = 'right'))#right common data
print(df1.merge(df2, on = 'id', how = 'outer')) # all data show common + incommon
print(pd.concat([df1,df2]))# union of both table, common cheze repeat hongi

   id  Maths  Physics
0   3     45       89
1   4     67       85
2   5     59       86
   id  Maths  Physics
0   1     87      NaN
1   2     98      NaN
2   3     45     89.0
3   4     67     85.0
4   5     59     86.0
   id  Maths  Physics
0   3   45.0       89
1   4   67.0       85
2   5   59.0       86
3   6    NaN       45
4   7    NaN       90
   id  Maths  Physics
0   1   87.0      NaN
1   2   98.0      NaN
2   3   45.0     89.0
3   4   67.0     85.0
4   5   59.0     86.0
5   6    NaN     45.0
6   7    NaN     90.0
   id  Maths  Physics
0   1   87.0      NaN
1   2   98.0      NaN
2   3   45.0      NaN
3   4   67.0      NaN
4   5   59.0      NaN
0   3    NaN     89.0
1   4    NaN     85.0
2   5    NaN     86.0
3   6    NaN     45.0
4   7    NaN     90.0

In [38]:
df3 = pd.DataFrame({'id':[1,2,3,4,5], 'Maths':[87,98,45,67,59], 'School':['A','B','C','B','A']})
df4 = pd.DataFrame({'id':[3,4,5,6,7], 'Physics':[89,85,86,45,90], 'School':['C','B','C','B','A']})
df3.merge(df4, on = ['id','School'], how = 'inner')

   id  Maths School  Physics
0   3     45      C       89
1   4     67      B       85

#### Reset index function
    Note-> Concat function use krke indexes both table ke liye alg bnti h
    -> reset_index() new index add ho jayegi both table ko ek entity mante hue
    -> reset_index(drop = True) both table ki individual index remove

In [ ]:
df = pd.concat([df1,df2])
print(df)

print(df.reset_index())

print(df.reset_index(drop=True))

   id  Maths  Physics
0   1   87.0      NaN
1   2   98.0      NaN
2   3   45.0      NaN
3   4   67.0      NaN
4   5   59.0      NaN
0   3    NaN     89.0
1   4    NaN     85.0
2   5    NaN     86.0
3   6    NaN     45.0
4   7    NaN     90.0
   index  id  Maths  Physics
0      0   1   87.0      NaN
1      1   2   98.0      NaN
2      2   3   45.0      NaN
3      3   4   67.0      NaN
4      4   5   59.0      NaN
5      0   3    NaN     89.0
6      1   4    NaN     85.0
7      2   5    NaN     86.0
8      3   6    NaN     45.0
9      4   7    NaN     90.0
   id  Maths  Physics
0   1   87.0      NaN
1   2   98.0      NaN
2   3   45.0      NaN
3   4   67.0      NaN
4   5   59.0      NaN
5   3    NaN     89.0
6   4    NaN     85.0
7   5    NaN     86.0
8   6    NaN     45.0
9   7    NaN     90.0

#### Join 
    -> join in pandas is new concept & no connection with sql
    -> used to combine two dataframe with index

In [ ]:
df1 = pd.DataFrame({ 'id': [1,2,3,4,5], 'Stat_marks' : [98,97,95,92,91]})
df2 = pd.DataFrame({ 'sno': [3,4,5,6,7], 'ML_marks' : [88,85,86,81,80]})
df1.join(df2)

#note both have same index unlike stacking both df and indexing

   id  Stat_marks  sno  ML_marks
0   1          98    3        88
1   2          97    4        85
2   3          95    5        86
3   4          92    6        81
4   5          91    7        80

#### Importing dataset in Pandas
    -> pwd -> present working directory # (the folder where pandasPractice.ipynb --current notebook is available )
    -> windows: E:\\My Practice
    -> You can navigate to this folder —> this pc —> E Drive -> My Practice
    -> windows: E:\\My Practice-> the file you will work should be in this folder to read it

    #if your file is available in any other location
     -> df1 = pd.read_csv(r'file location path') where r---> read/raw string
    

    # pw and run it, it will return present working directory
         -> now it is E:\\My Practice

In [17]:
df1 = pd.read_csv('AutoMy.csv')
print(type(df1))
df1.head()

<class 'pandas.core.frame.DataFrame'>

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino

In [18]:
df1.tail()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
392,27.0,4.0,140.0,86,2790,15.6,82,1,ford mustang gl
393,44.0,4.0,97.0,52,2130,24.6,82,2,vw pickup
394,32.0,4.0,135.0,84,2295,11.6,82,1,dodge rampage
395,28.0,4.0,120.0,79,2625,18.6,82,1,ford ranger
396,31.0,4.0,119.0,82,2720,19.4,82,1,chevy s-10

    # df1.head() -> its returns top 5 observations/rows/records/data point
    # your function name and extension using should match with each other

    # excel file --> .xlsx --> read_excel()
    # csv file   --> .csv --> read_csv()
    # any file   --> .extension --> read_file name()
     ->pandas support many files
     
    # df.head(n) -> n is number of observation we want, default is 5 -> from upper side
    # df.tail(n) -> observation from lower side and default return lowest 5

#### Analysing the Data
    1-> using shape() funtion check number of rows and column manually are same as imported file, because there can be connection error, or not imported properly and if not then import again.
    2-> now check every data type is same as in the imported file manually.

    # shape()
     df1.shape, return number of rows and column
 
    # types()
     df1.dtypes, return all data types
      ->numbers-> int/float
      ->strings-> object
    
    # columns 
    -> return name of all columns
    # isnull()
      -> column that have NaN values will be show True in the frame
    # isnull().sum() 
      -> sum of total NaN value of True values, kitne values khali h bas ye pta krne k liye
    # count() 
      -> shows number of elements in the column that has values ie. NaN values se alag
    #info()
      -> to show everything the we read upper in one click
    # describe() 
      -> will give stats analysis of each column/ will work on int/float only

In [19]:
df1.shape
# yes there are 397 rows and 9 column by seening manully

(397, 9)

In [20]:
df1.dtypes

#there is issue in horse power by seen manually in excel sheet, because there are some NaN values

mpg             float64
cylinders       float64
displacement    float64
Horse Power      object
weight            int64
acceleration    float64
year              int64
origin            int64
name             object
dtype: object

In [21]:
df1.columns
#returns all name of columns or indexes of frame

Index(['mpg', 'cylinders', 'displacement', 'Horse Power', 'weight',
       'acceleration', 'year', 'origin', 'name'],
      dtype='object')

In [22]:
df1.isnull()
#showing NaN values as True

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,True,False,False,False,False,False,False,False,False
3,True,False,True,False,False,False,False,False,False
4,True,False,True,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
392,False,False,False,False,False,False,False,False,False
393,False,False,False,False,False,False,False,False,False
394,False,False,False,False,False,False,False,False,False
395,False,False,False,False,False,False,False,False,False
396,False,False,False,False,False,False,False,False,False

In [23]:
df1.isnull().sum()
# showing total null or NaN values, simply sum function ne sum kr diya

mpg             5
cylinders       3
displacement    5
Horse Power     0
weight          0
acceleration    0
year            0
origin          0
name            0
dtype: int64

In [24]:
df1.count()
#showing total existing values besides the NaN from 397

mpg             392
cylinders       394
displacement    392
Horse Power     397
weight          397
acceleration    397
year            397
origin          397
name            397
dtype: int64

In [25]:
df1.info()
#showing everything 
#note to find NaN or Null content just 397 - Non Null content

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     394 non-null    float64
 2   displacement  392 non-null    float64
 3   Horse Power   397 non-null    object
 4   weight        397 non-null    int64
 5   acceleration  397 non-null    float64
 6   year          397 non-null    int64
 7   origin        397 non-null    int64
 8   name          397 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.0+ KB

In [26]:
df1.describe()
# we can do this same thing by using pritn statment
# returns count, mean, standard deviation, percentile, min and max values

,mpg,cylinders,displacement,weight,acceleration,year,origin
count,392.000000,394.000000,392.000000,397.000000,397.000000,397.000000,397.000000
mean,23.611735,5.439086,191.080357,2970.261965,15.555668,75.994962,1.574307
std,7.827466,1.693452,102.452019,847.904119,2.749995,3.690005,0.802549
min,9.000000,3.000000,68.000000,1613.000000,8.000000,70.000000,1.000000
25%,17.500000,4.000000,100.750000,2223.000000,13.800000,73.000000,1.000000
50%,23.000000,4.000000,145.500000,2800.000000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,260.000000,3609.000000,17.100000,79.000000,2.000000
max,46.600000,8.000000,455.000000,5140.000000,24.800000,82.000000,3.000000

In [27]:
print(df1)

      mpg  cylinders  displacement Horse Power  weight  acceleration  year  \
0    18.0        8.0         307.0         130    3504          12.0    70
1    15.0        8.0         350.0         165    3693          11.5    70
2     NaN        8.0         318.0         150    3436          11.0    70
3     NaN        8.0           NaN         150    3433          12.0    70
4     NaN        8.0           NaN         140    3449          10.5    70
..    ...        ...           ...         ...     ...           ...   ...
392  27.0        4.0         140.0          86    2790          15.6    82
393  44.0        4.0          97.0          52    2130          24.6    82
394  32.0        4.0         135.0          84    2295          11.6    82
395  28.0        4.0         120.0          79    2625          18.6    82
396  31.0        4.0         119.0          82    2720          19.4    82

     origin                       name
0         1  chevrolet chevelle malibu
1         1          buick skylark 320
2         1         plymouth satellite
3         1              amc rebel sst
4         1                ford torino
..      ...                        ...
392       1            ford mustang gl
393       2                  vw pickup
394       1              dodge rampage
395       1                ford ranger
396       1                 chevy s-10

[397 rows x 9 columns]

#### Extract single or multiple Columns
    ->By simply using square brackets - df1['name of col'] 

    # we can also attach mathematical funtion to any column
    -> Example - df1['mpg'].mean() or .max() or .min()

In [28]:
df1['mpg']

0      18.0
1      15.0
2       NaN
3       NaN
4       NaN
       ...
392    27.0
393    44.0
394    32.0
395    28.0
396    31.0
Name: mpg, Length: 397, dtype: float64

In [29]:
df1[['mpg','acceleration','displacement']]

      mpg  acceleration  displacement
0    18.0          12.0         307.0
1    15.0          11.5         350.0
2     NaN          11.0         318.0
3     NaN          12.0           NaN
4     NaN          10.5           NaN
..    ...           ...           ...
392  27.0          15.6         140.0
393  44.0          24.6          97.0
394  32.0          11.6         135.0
395  28.0          18.6         120.0
396  31.0          19.4         119.0

[397 rows x 3 columns]

In [30]:
df1['mpg'].mean()
# return mean of mpg values

np.float64(23.611734693877548)

In [31]:
df1['mpg'].max()
#return max value of mpg column

np.float64(46.6)

In [32]:
df1['mpg'].min()
#return minimum value of mpg coloumn

np.float64(9.0)

#### Feature Engineering
    ->Adding new column or updating old  with any mathematical operation(+,-,/,*,//,** )

    #Note
     ->if new name was given --> new column will be created
     ->if old name was given --> values inside older column will be replaced

    #Note
     ->Every manipulation you do is only working in df1 dataFrame, there will be no change in original csv file
     ->we can export this current df1 file

In [33]:
df1.head(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320

In [34]:
df1['WsumO'] = df1['weight'] + df1['origin']
df1.head(2)
#here adding new col WsumO contains sum of weight and origin

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,WsumO
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,3505
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,3694

In [35]:
df1['SquareOfAcc'] = df1['acceleration']**2
df1.head(2)
#adding new column SquareOfAcc contain squre of accelartion of each element

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,WsumO,SquareOfAcc
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,3505,144.00
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,3694,132.25

   #IF want to update the existing column

In [36]:
df1['SquareOfAcc'] = df1['acceleration']**3
df1.head(2)
#now squareofacc contains cube of every element

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,WsumO,SquareOfAcc
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,3505,1728.000
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,3694,1520.875

#### Cleaning the Dataset in DataFrmae
    ->changing into different dataset
    ->remove unnecessary string
    ->adding meaningfull data into rows


    # astype(datatype) : int <--> float , str , any do-able data type changes
    # to_numeric: forcefully changing agr nhi hora to

In [37]:
df1['NewAcceleration'] = df1['acceleration'].astype(int)
df1.head()
#adding new column having acceleration of integer values

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,WsumO,SquareOfAcc,NewAcceleration
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,3505,1728.000,12
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,3694,1520.875,11
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite,3437,1331.000,11
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst,3434,1728.000,12
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino,3450,1157.625,10

In [38]:
df1['Horse Power'].isnull().sum()
#here we can see there is no null values inside column of horse power
#chahe vo question mark(?) se hi fill ho column

np.int64(0)

    #Note in column of Horse Power
     ->Real file me 5 loaction pe ?(Question Mark) h
     ->to ?(Question Mark) kaise change hoga 

     #ek bar forcefully try kre to_numeric ka use krkre hoga

In [39]:
df1['Horse Power'].astype(int)
#not possible to change (Question Mark) to int
#ValueError: invalid literal for int() with base 10: '?', we can see at the end of msg

ValueError: invalid literal for int() with base 10: '?'

In [40]:
pd.to_numeric(df1['Horse Power'])
#yha se pta lga kch psoitions me "?" fill as a value jo int me change nhi hua tha jb try kra ktne ki
#ValueError: Unable to parse string "?" at position 32


# errors = 'coerce' -> try to change data in int/float or if not possible then remove the string

ValueError: Unable to parse string "?" at position 32

In [41]:
df1['Horse Power'] = pd.to_numeric(df1['Horse Power'],errors = 'coerce')

#lge hath df1 me update bhi krdiya

In [42]:
df1['Horse Power'].isnull().sum()
# since 5 values eliminate bcz of'?' so showing 5 null values

np.int64(5)

#### HOW to HANDLE missing values
     -> dropna: to remove the null value of a data frame 
        -> df1.dropna()
        -> to make save update simple re-assign to original column

           #example -> df1 = df1.dropna()
                        or
                       df1.dropna(inplace = True)   Best workflow (to avoid this mistake in future) because it removes all NaN places 

    -> fillna: to replace that missing value with something else if inplace = true
        -> To replace your missing values --> mean, median, mode --> these options are best
        -> replacing missing values with average(mean) --> one of the best option # stats property
        -> agr pemanent change krna to fir dubara df1 me hi assign ke dena

           #example -> df1['col'] = df1['col'].fillna(value)
                        or
                       df1.fillna({'col name': value}, inplace=True)


      NOTE - ****** 
          If you drop NaN → the row is deleted forever and then you try fill these places nothing happen because places removed
          If you fill NaN → the row is kept and value is replaced means direclty fill the values at NaN you want

In [43]:
df1.head(10)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,WsumO,SquareOfAcc,NewAcceleration
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,3505,1728.000,12
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,3694,1520.875,11
2,NaN,8.0,318.0,150.0,3436,11.0,70,1,plymouth satellite,3437,1331.000,11
3,NaN,8.0,NaN,150.0,3433,12.0,70,1,amc rebel sst,3434,1728.000,12
4,NaN,8.0,NaN,140.0,3449,10.5,70,1,ford torino,3450,1157.625,10
5,NaN,8.0,NaN,198.0,4341,10.0,70,1,ford galaxie 500,4342,1000.000,10
6,NaN,8.0,NaN,220.0,4354,9.0,70,1,chevrolet impala,4355,729.000,9
7,14.0,8.0,NaN,215.0,4312,8.5,70,1,plymouth fury iii,4313,614.125,8
8,14.0,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,4426,1000.000,10
9,15.0,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl,3851,614.125,8

In [ ]:
#df1.dropna(inplace=True)
# dont do this note

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320
8,14.0,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina
9,15.0,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl
10,15.0,8.0,383.0,170.0,3563,10.0,70,1,dodge challenger se

In [44]:
df1['mpg'].mean()

np.float64(23.611734693877548)

In [46]:
df1['mpg'] = df1['mpg'].fillna(23.639164490861617)

df1.head(10)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,WsumO,SquareOfAcc,NewAcceleration
0,18.000000,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,3505,1728.000,12
1,15.000000,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,3694,1520.875,11
2,23.639164,8.0,318.0,150.0,3436,11.0,70,1,plymouth satellite,3437,1331.000,11
3,23.639164,8.0,NaN,150.0,3433,12.0,70,1,amc rebel sst,3434,1728.000,12
4,23.639164,8.0,NaN,140.0,3449,10.5,70,1,ford torino,3450,1157.625,10
5,23.639164,8.0,NaN,198.0,4341,10.0,70,1,ford galaxie 500,4342,1000.000,10
6,23.639164,8.0,NaN,220.0,4354,9.0,70,1,chevrolet impala,4355,729.000,9
7,14.000000,8.0,NaN,215.0,4312,8.5,70,1,plymouth fury iii,4313,614.125,8
8,14.000000,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,4426,1000.000,10
9,15.000000,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl,3851,614.125,8

In [ ]:
df1.isnull().sum()
# hurray we fix NaN values of mpg

mpg                0
cylinders          3
displacement       5
Horse Power        5
weight             0
acceleration       0
year               0
origin             0
name               0
WsumO              0
SquareOfAcc        0
NewAcceleration    0
dtype: int64

#### Data Manipulation
     # To take sub part of table -> same as silicing concept in arrays in numpy and pyhton
     # two ways->

     # iloc[r:c,r:c] , [for rowns, for col]
       -uses index to locate
       -end value is not included

    # loc[name,name]
       -it uses names to extract the data
       -end value is included"

In [49]:
df1.iloc[1:9,2:6] # rows:col

   displacement  Horse Power  weight  acceleration
1         350.0        165.0    3693          11.5
2         318.0        150.0    3436          11.0
3           NaN        150.0    3433          12.0
4           NaN        140.0    3449          10.5
5           NaN        198.0    4341          10.0
6           NaN        220.0    4354           9.0
7           NaN        215.0    4312           8.5
8         455.0        225.0    4425          10.0

In [50]:
df1.loc[1:8, 'displacement': 'acceleration']

   displacement  Horse Power  weight  acceleration
1         350.0        165.0    3693          11.5
2         318.0        150.0    3436          11.0
3           NaN        150.0    3433          12.0
4           NaN        140.0    3449          10.5
5           NaN        198.0    4341          10.0
6           NaN        220.0    4354           9.0
7           NaN        215.0    4312           8.5
8         455.0        225.0    4425          10.0

#### Applying a function to a data frame
     -> Suppose We want to square the acceleration column

     # 1st way using operator
      -> df1['acceleration']**2
    
     # 2nd way using loop
      -> for i in df1['acceleration']:print(i**2)
    
     # 3rd way other way to use loop 
      -> res = [i**2 for i in df1['acceleration']] and now df1['New col'] = res

     # 4th way using function
      -> def sqr(num):
          return num**2 

    ->  apply(func you defined), we can direclty use apply function to apply the function so jha bhi complex function lgana ho apply use kro

    # lambda() function
      -> anonymous function that execute only one time 
      -> used in simple logics
      -> faster then def
      -> def used where function is used multiple times

In [51]:
def square(num):
    return num**2

In [52]:
res = df1['acceleration'].apply(square)
print(res)

0      144.00
1      132.25
2      121.00
3      144.00
4      110.25
        ...
392    243.36
393    605.16
394    134.56
395    345.96
396    376.36
Name: acceleration, Length: 397, dtype: float64

In [53]:
df1['acceleration'].apply(lambda num: num**2)

0      144.00
1      132.25
2      121.00
3      144.00
4      110.25
        ...
392    243.36
393    605.16
394    134.56
395    345.96
396    376.36
Name: acceleration, Length: 397, dtype: float64

In [54]:
df1['acceleration'].apply(lambda num: 'Even ' if num%2 == 0 else 'Odd')

0      Even
1        Odd
2        Odd
3      Even
4        Odd
       ...
392      Odd
393      Odd
394      Odd
395      Odd
396      Odd
Name: acceleration, Length: 397, dtype: object

####  Taking subet from DataFrame based on condition
     -> define condition and use in data frame directly
       examples are below

In [ ]:
# Q1->I wanted to extracted mpg rows where value >40
cond = df1['mpg'] > 40
cond
# Here are output is in flags if we use this condition direcly in dataframe its returns only true value

0      False
1      False
2      False
3      False
4      False
       ...
392    False
393     True
394    False
395    False
396    False
Name: mpg, Length: 397, dtype: bool

In [ ]:
df1[cond]
# this will extract the records where result is true in condition 1

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,WsumO,SquareOfAcc,NewAcceleration
244,43.1,4.0,90.0,48.0,1985,21.5,78,2,volkswagen rabbit custom diesel,1987,9938.375,21
309,41.5,4.0,98.0,76.0,2144,14.7,80,2,vw rabbit,2146,3176.523,14
322,46.6,4.0,86.0,65.0,2110,17.9,80,3,mazda glc,2113,5735.339,17
324,40.8,4.0,85.0,65.0,2110,19.2,80,3,datsun 210,2113,7077.888,19
325,44.3,4.0,90.0,48.0,2085,21.7,80,2,vw rabbit c (diesel),2087,10218.313,21
326,43.4,4.0,90.0,48.0,2335,23.7,80,2,vw dasher (diesel),2337,13312.053,23
329,44.6,4.0,91.0,67.0,1850,13.8,80,3,honda civic 1500 gl,1853,2628.072,13
330,40.9,4.0,85.0,NaN,1835,17.3,80,2,renault lecar deluxe,1837,5177.717,17
393,44.0,4.0,97.0,52.0,2130,24.6,82,2,vw pickup,2132,14886.936,24

In [58]:
# Q2->I wanted to extracted mpg rows where value >40 and origin is 3
cond2 = (df1['mpg']>40) & (df1['origin'] == 3)
cond2

0      False
1      False
2      False
3      False
4      False
       ...
392    False
393    False
394    False
395    False
396    False
Length: 397, dtype: bool

In [59]:
df1[cond2]

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,WsumO,SquareOfAcc,NewAcceleration
322,46.6,4.0,86.0,65.0,2110,17.9,80,3,mazda glc,2113,5735.339,17
324,40.8,4.0,85.0,65.0,2110,19.2,80,3,datsun 210,2113,7077.888,19
329,44.6,4.0,91.0,67.0,1850,13.8,80,3,honda civic 1500 gl,1853,2628.072,13

In [60]:
# Direct way 
df1[(df1['mpg'] > 40) & (df1['origin'] ==3)]

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,WsumO,SquareOfAcc,NewAcceleration
322,46.6,4.0,86.0,65.0,2110,17.9,80,3,mazda glc,2113,5735.339,17
324,40.8,4.0,85.0,65.0,2110,19.2,80,3,datsun 210,2113,7077.888,19
329,44.6,4.0,91.0,67.0,1850,13.8,80,3,honda civic 1500 gl,1853,2628.072,13

    #NOTE -> To compare individual values use - 'and'
          -> To compare series/ data frame use bitwise operator &,/,~
             cond2 = (df1['mpg'] > 40) and (df1['origin'] ==3) --> this is wrong

#### To export the result into files 
     -> just like excel, csv, and many more available
     -> df1.to_excel('output.xlsx', index = False) # index = false if index is not needed
     -> df1.to_csv('output.csv', index = False) # index = false if index is not needed

In [61]:
# Question shows many function at the same time
df1.groupby(['cylinders','origin'])['mpg'].mean().reset_index()

   cylinders  origin        mpg
0        3.0       3  20.550000
1        4.0       1  27.908451
2        4.0       2  28.411111
3        4.0       3  31.595652
4        5.0       2  27.366667
5        6.0       1  19.663514
6        6.0       2  20.100000
7        6.0       3  23.883333
8        8.0       1  15.363958